# STLImportOptions Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
STLImportOptions Constructor
STLImportOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| STLImportOptions()()()() | Constructs a new instance of STLImportOptions with default values of all properties. |
| STLImportOptions(STLImportOptions) | Constructs a new instance of STLImportOptions as a copy of the import options. |

# See Also
STLImportOptions Class
STLImportOptions Members
Autodesk.Revit.DB Namespace